; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v7 ?v2)
             (pred_5 ?v4 ?v5)
             (pred_1 ?v7 ?v5)
             (pred_12 ?v8 ?v7 )
	     (pred_10 ?v7)
             (pred_4 ?v12)
             (pred_3 ?v4)
             (pred_7 ?v5)
             (pred_8 ?v7)
             (pred_2 ?v4)
             (pred_11 ?v7)
             (pred_9 ))



(:action op_3
:parameters (?v9 ?v1 ?v13 ?v10)
:precondition (and (pred_4 ?v9) (pred_4 ?v1) (pred_3 ?v13) (pred_7 ?v10)
          (pred_6 ?v9 ?v1) (pred_5 ?v13 ?v10)
                   (pred_1 ?v1 ?v10) (pred_10 ?v9) 
                   (pred_8 ?v1) (pred_2 ?v13))
:effect (and  (pred_11 ?v1) (not (pred_8 ?v1))))


(:action op_1
:parameters (?v9 ?v3)
:precondition (and (pred_4 ?v9) (pred_4 ?v3)
               (pred_10 ?v9) (pred_6 ?v9 ?v3) (pred_11 ?v3))
:effect (and (pred_10 ?v3) (not (pred_10 ?v9))))

(:action op_2
:parameters (?v9 ?v13)
:precondition (and (pred_4 ?v9) (pred_3 ?v13) 
                  (pred_10 ?v9) (pred_12 ?v13 ?v9) (pred_9 ))
:effect (and (pred_2 ?v13)
   (not (pred_12 ?v13 ?v9)) (not (pred_9 ))))


(:action op_5
:parameters (?v9 ?v11 ?v6)
:precondition (and (pred_4 ?v9) (pred_3 ?v11) (pred_3 ?v6)
                  (pred_10 ?v9) (pred_2 ?v6) (pred_12 ?v11 ?v9))
:effect (and (pred_2 ?v11) (pred_12 ?v6 ?v9)
        (not (pred_2 ?v6)) (not (pred_12 ?v11 ?v9))))

(:action op_4
:parameters (?v9 ?v13)
:precondition (and (pred_4 ?v9) (pred_3 ?v13) 
                  (pred_10 ?v9) (pred_2 ?v13))
:effect (and (pred_9 ) (pred_12 ?v13 ?v9) (not (pred_2 ?v13)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_24 obj_16 obj_12 obj_26 obj_11 obj_18 obj_30 obj_22 obj_20 obj_19 obj_17 obj_05 obj_02 obj_15 obj_08 obj_23 obj_01 obj_06 obj_28 obj_09 obj_25 obj_04 obj_07 obj_14 obj_10
    obj_21 obj_29
    obj_27 obj_13 obj_03
    )

    (:init
       (pred_9)

       (pred_4 obj_24)
       (pred_4 obj_16)
       (pred_4 obj_12)
       (pred_4 obj_26)
       (pred_4 obj_11)
       (pred_4 obj_18)
       (pred_4 obj_30)
       (pred_4 obj_22)
       (pred_4 obj_20)
       (pred_4 obj_19)
       (pred_4 obj_17)
       (pred_4 obj_05)
       (pred_4 obj_02)
       (pred_4 obj_15)
       (pred_4 obj_08)
       (pred_4 obj_23)
       (pred_4 obj_01)
       (pred_4 obj_06)
       (pred_4 obj_28)
       (pred_4 obj_09)
       (pred_4 obj_25)
       (pred_4 obj_04)
       (pred_4 obj_07)
       (pred_4 obj_14)
       (pred_4 obj_10)
       (pred_7 obj_21)
       (pred_7 obj_29)
       (pred_3 obj_27)
       (pred_3 obj_13)
       (pred_3 obj_03)

       (pred_6 obj_24 obj_18)
       (pred_6 obj_24 obj_16)
       (pred_6 obj_16 obj_30)
       (pred_6 obj_16 obj_12)
       (pred_6 obj_16 obj_24)
       (pred_6 obj_12 obj_22)
       (pred_6 obj_12 obj_26)
       (pred_6 obj_12 obj_16)
       (pred_6 obj_26 obj_20)
       (pred_6 obj_26 obj_11)
       (pred_6 obj_26 obj_12)
       (pred_6 obj_11 obj_19)
       (pred_6 obj_11 obj_26)
       (pred_6 obj_18 obj_17)
       (pred_6 obj_18 obj_30)
       (pred_6 obj_18 obj_24)
       (pred_6 obj_30 obj_05)
       (pred_6 obj_30 obj_22)
       (pred_6 obj_30 obj_16)
       (pred_6 obj_30 obj_18)
       (pred_6 obj_22 obj_02)
       (pred_6 obj_22 obj_20)
       (pred_6 obj_22 obj_12)
       (pred_6 obj_22 obj_30)
       (pred_6 obj_20 obj_15)
       (pred_6 obj_20 obj_19)
       (pred_6 obj_20 obj_26)
       (pred_6 obj_20 obj_22)
       (pred_6 obj_19 obj_08)
       (pred_6 obj_19 obj_11)
       (pred_6 obj_19 obj_20)
       (pred_6 obj_17 obj_23)
       (pred_6 obj_17 obj_05)
       (pred_6 obj_17 obj_18)
       (pred_6 obj_05 obj_01)
       (pred_6 obj_05 obj_02)
       (pred_6 obj_05 obj_30)
       (pred_6 obj_05 obj_17)
       (pred_6 obj_02 obj_06)
       (pred_6 obj_02 obj_15)
       (pred_6 obj_02 obj_22)
       (pred_6 obj_02 obj_05)
       (pred_6 obj_15 obj_28)
       (pred_6 obj_15 obj_08)
       (pred_6 obj_15 obj_20)
       (pred_6 obj_15 obj_02)
       (pred_6 obj_08 obj_09)
       (pred_6 obj_08 obj_19)
       (pred_6 obj_08 obj_15)
       (pred_6 obj_23 obj_25)
       (pred_6 obj_23 obj_01)
       (pred_6 obj_23 obj_17)
       (pred_6 obj_01 obj_04)
       (pred_6 obj_01 obj_06)
       (pred_6 obj_01 obj_05)
       (pred_6 obj_01 obj_23)
       (pred_6 obj_06 obj_07)
       (pred_6 obj_06 obj_28)
       (pred_6 obj_06 obj_02)
       (pred_6 obj_06 obj_01)
       (pred_6 obj_28 obj_14)
       (pred_6 obj_28 obj_09)
       (pred_6 obj_28 obj_15)
       (pred_6 obj_28 obj_06)
       (pred_6 obj_09 obj_10)
       (pred_6 obj_09 obj_08)
       (pred_6 obj_09 obj_28)
       (pred_6 obj_25 obj_04)
       (pred_6 obj_25 obj_23)
       (pred_6 obj_04 obj_07)
       (pred_6 obj_04 obj_01)
       (pred_6 obj_04 obj_25)
       (pred_6 obj_07 obj_14)
       (pred_6 obj_07 obj_06)
       (pred_6 obj_07 obj_04)
       (pred_6 obj_14 obj_10)
       (pred_6 obj_14 obj_28)
       (pred_6 obj_14 obj_07)
       (pred_6 obj_10 obj_09)
       (pred_6 obj_10 obj_14)
       (pred_8 obj_23)
       (pred_8 obj_14)
       (pred_8 obj_05)
       (pred_1  obj_23 obj_21)
       (pred_1  obj_14 obj_29)
       (pred_1  obj_05 obj_21)
       (pred_11 obj_24)
       (pred_11 obj_16)
       (pred_11 obj_12)
       (pred_11 obj_26)
       (pred_11 obj_11)
       (pred_11 obj_18)
       (pred_11 obj_30)
       (pred_11 obj_22)
       (pred_11 obj_20)
       (pred_11 obj_19)
       (pred_11 obj_17)
       (pred_11 obj_02)
       (pred_11 obj_15)
       (pred_11 obj_08)
       (pred_11 obj_01)
       (pred_11 obj_06)
       (pred_11 obj_28)
       (pred_11 obj_09)
       (pred_11 obj_25)
       (pred_11 obj_04)
       (pred_11 obj_07)
       (pred_11 obj_10)

       (pred_5  obj_27 obj_21)
       (pred_5  obj_13 obj_29)
       (pred_5  obj_03 obj_21)
       (pred_12 obj_27 obj_16)
       (pred_12 obj_13 obj_17)
       (pred_12 obj_03 obj_30)
       (pred_10 obj_04)
    )

    (:goal (and
       (pred_12 obj_27 obj_30)
    ))
(:constraints
  (always (not (pred_10 obj_01)))
)
)

; plan
1. (op_1 obj_04 obj_07)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_07)
   goals met: 0 of 1
2. (op_1 obj_07 obj_06)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_06)
   goals met: 0 of 1
3. (op_1 obj_06 obj_02)
   deleted: (pred_10 obj_06)
   added: (pred_10 obj_02)
   goals met: 0 of 1
4. (op_1 obj_02 obj_22)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_22)
   goals met: 0 of 1
5. (op_1 obj_22 obj_30)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_30)
   goals met: 0 of 1
6. (op_1 obj_30 obj_16)
   deleted: (pred_10 obj_30)
   added: (pred_10 obj_16)
   goals met: 0 of 1
7. (op_2 obj_16 obj_27)
   deleted: (pred_12 obj_27 obj_16) (pred_9)
   added: (pred_2 obj_27)
   goals met: 0 of 1
8. (op_1 obj_16 obj_30)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_30)
   goals met: 0 of 1
9. (op_5 obj_30 obj_03 obj_27)
   deleted: (pred_2 obj_27) (pred_12 obj_03 obj_30)
   added: (pred_2 obj_03) (pred_12 obj_27 obj_30)
   goals met: 1 of 1
